
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>游戏编程入门指南 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="IndieGameDevTutorial.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    序
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="GameProgramTutorial.html">
            
                <a href="GameProgramTutorial.html">
            
                    
                    游戏编程入门指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="IndieGameDevTutorial.html">
            
                <a href="IndieGameDevTutorial.html">
            
                    
                    独立游戏开发入门指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="EditorTutorial.html">
            
                <a href="EditorTutorial.html">
            
                    
                    Unity拓展编辑器入门指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="MakingOfIPixFont.html">
            
                <a href="MakingOfIPixFont.html">
            
                    
                    IPix中文像素字体制作
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >游戏编程入门指南</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x6E38;&#x620F;&#x4EE3;&#x7801;&#x4E5F;&#x5199;&#x4E86;&#x51E0;&#x5E74;&#xFF0C; &#x6709;&#x65F6;&#x5019;&#x5728;&#x60F3;&#x5982;&#x679C;&#x73B0;&#x5728;&#x7ED9;&#x521A;&#x5165;&#x884C;&#x7684;&#x81EA;&#x5DF1;&#x4E00;&#x70B9;&#x5EFA;&#x8BAE;&#x4E5F;&#x8BB8;&#x80FD;&#x6709;&#x4E00;&#x70B9;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x7BC7;&#x65E5;&#x5FD7;&#x4E3B;&#x8981;&#x662F;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x5BF9;&#x4E8E;&#x6E38;&#x620F;&#x7F16;&#x7A0B;&#x5165;&#x95E8;&#x7684;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x3002;</p>
<h2 id="&#x8BED;&#x8A00;&#x7684;&#x9009;&#x62E9;">&#x8BED;&#x8A00;&#x7684;&#x9009;&#x62E9;</h2>
<p>&#x5728;&#x4E00;&#x5F00;&#x59CB;&#x66F4;&#x591A;&#x662F;&#x63A8;&#x8350;&#x4ECE;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x5165;&#x95E8;&#xFF0C;&#x6BD4;&#x5982;Java&#x3001;C#&#x3001;lua&#x3001;python&#xFF0C;javascript&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x671F;&#x53EF;&#x4EE5;&#x914D;&#x5408;&#x4E00;&#x4E9B;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x6765;&#x5B66;&#x4E60;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x662F;&#x56E0;&#x4E3A;&#x559C;&#x6B22;&#x6E38;&#x620F;&#x624D;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x7684;&#x53EF;&#x80FD;&#x4E0D;&#x559C;&#x6B22;&#x8001;&#x662F;print&#x4E00;&#x4E9B;&#x6587;&#x5B57;&#xFF0C;&#x53EF;&#x80FD;&#x66F4;&#x559C;&#x6B22;&#x8F93;&#x51FA;&#x56FE;&#x7247;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4ECE;&#x5BF9;&#x5E94;&#x8BED;&#x8A00;&#x7684;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x5F00;&#x59CB;&#x505A;&#x51E0;&#x4E2A;&#x5C0F;Demo&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x6E38;&#x620F;&#x6784;&#x9020;&#xFF0C;&#x4F46;&#x662F;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x6709;&#x4E2A;&#x5F0A;&#x7AEF;&#x5C31;&#x662F;API&#x592A;&#x591A;&#x5165;&#x95E8;&#x6709;&#x70B9;&#x96BE;&#x2026;&#x2026;</p>
<p>&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x7684;&#x4F18;&#x70B9;&#x662F;&#x505A;&#x6E38;&#x620F;&#x4F1A;&#x6BD4;&#x8F83;&#x5FEB;&#xFF0C;&#x4F46;&#x662F;&#x5F15;&#x64CE;&#x6574;&#x4F53;&#x8FD8;&#x662F;&#x7565;&#x5E9E;&#x5927;&#xFF0C;&#x4E0D;&#x9002;&#x5408;&#x5B66;&#x4E60;&#x4EE3;&#x7801;&#x4E4B;&#x7528;&#x3002;</p>
<p>&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<a href="https://www.lexaloffle.com/pico-8.php" target="_blank">pico-8</a>&#x3001;<a href="https://love2d.org/" target="_blank">love2d</a>&#x3001;<a href="https://www.pygame.org/news" target="_blank">pygame</a>&#x3001;<a href="https://www.libsdl.org/" target="_blank">SDL</a>&#x6216;&#x8005;&#x76F4;&#x63A5;javascript&#x64CD;&#x4F5C;canvas&#x753B;&#x5E03;&#x6765;&#x5236;&#x4F5C;&#x5C1D;&#x8BD5;&#x5236;&#x4F5C;&#x6E38;&#x620F;&#x6311;&#x6218;&#x81EA;&#x5DF1;&#x7F16;&#x7A0B;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x800C;C&#x8BED;&#x8A00;&#xFF08;&#x5305;&#x542B;C++&#xFF09;&#x53EF;&#x4EE5;&#x653E;&#x5728;&#x540E;&#x7EED;&#x7814;&#x7A76;&#xFF0C;&#x7814;&#x7A76;C&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x5BF9;&#x8BED;&#x8A00;&#x5E95;&#x5C42;&#x70B9;&#x7684;&#x4E1C;&#x897F;&#x7406;&#x89E3;&#x3002;&#x50CF;&#x6307;&#x9488;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x5728;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x4E2D;&#x662F;&#x5F88;&#x5C11;&#x89C1;&#x3002;&#x53EF;&#x80FD;&#x4E00;&#x822C;&#x611F;&#x53D7;&#x4E0D;&#x51FA;&#x6765;&#x5B83;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x4F46;&#x5F53;&#x4F60;&#x9762;&#x5BF9;&#x8D44;&#x6E90;&#x7D27;&#x5F20;&#x7684;&#x7CFB;&#x7EDF;&#xFF08;&#x9700;&#x8981;&#x624B;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#xFF09;&#xFF0C;&#x6BD4;&#x5982;GBA&#x548C;NDS&#x4E0A;&#x9762;&#x7684;&#x7F16;&#x7A0B;&#x65F6;&#x5019;&#x5C31;&#x7ED5;&#x4E0D;&#x5F00;C&#x8BED;&#x8A00;&#x751A;&#x81F3;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x4E86;&#x3002;</p>
<h2 id="&#x4E00;&#x5B9A;&#x8981;&#x591A;&#x52A8;&#x624B;">&#x4E00;&#x5B9A;&#x8981;&#x591A;&#x52A8;&#x624B;</h2>
<p>&#x6211;&#x5728;&#x6CA1;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x4E4B;&#x524D;&#x662F;&#x4E2A;&#x7231;&#x770B;&#x4E66;&#x7684;&#x5C0F;&#x9752;&#x5E74;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x6211;&#x521A;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x5019;&#x5E38;&#x5E38;&#x5C31;&#x4E00;&#x76F4;&#x770B;&#x4E66;&#x6CA1;&#x6709;&#x5B9E;&#x8DF5;&#xFF0C;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#x770B;&#x4F3C;&#x61C2;&#x4E86;&#xFF0C;&#x5B9E;&#x9645;&#x8FD8;&#x662F;&#x8981;&#x4E0A;&#x624B;&#x64CD;&#x4F5C;&#x624D;&#x80FD;&#x638C;&#x63E1;&#x900F;&#x5F7B;&#x3002;</p>
<p>&#x5728;&#x7740;&#x624B;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x5019;&#x6700;&#x597D;&#x662F;<strong>&#x5E26;&#x7740;&#x95EE;&#x9898;&#x53BB;&#x5B66;&#x4E60;</strong>&#xFF0C;&#x7F16;&#x7A0B;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x628A;&#x590D;&#x6742;&#x95EE;&#x9898;&#x5206;&#x89E3;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x5236;&#x4F5C;&#x4E00;&#x4E2A;&#x5C0F;Demo&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x8FD9;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x4F55;&#x663E;&#x793A;&#x4E00;&#x4E2A;&#x56FE;&#x7247;/&#x7CBE;&#x7075;</li>
<li>&#x5982;&#x4F55;&#x64AD;&#x653E;&#x5E27;&#x52A8;&#x753B;</li>
<li>&#x5982;&#x4F55;&#x63A7;&#x5236;&#x4E24;&#x4E2A;&#x7269;&#x4F53;&#x78B0;&#x649E;</li>
<li>&#x4E24;&#x4E2A;&#x7269;&#x4F53;&#x78B0;&#x649E;&#x65F6;&#x5019;&#x9500;&#x6BC1;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x540C;&#x65F6;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x7269;&#x4F53;&#x64AD;&#x653E;&#x5E27;&#x52A8;&#x753B;&#x7279;&#x6548;&#x7136;&#x540E;&#x64AD;&#x653E;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x9500;&#x6BC1;</li>
<li>&#x5982;&#x4F55;&#x64AD;&#x653E;&#x97F3;&#x4E50;&#x97F3;&#x6548;</li>
<li>&#x80CC;&#x666F;&#x5C42;&#x6EDA;&#x52A8;&#x6548;&#x679C;&#x600E;&#x4E48;&#x505A;</li>
<li>&#x5982;&#x4F55;&#x5904;&#x7406;&#x5B58;&#x6863;&#xFF08;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5316;&#xFF09;</li>
</ul>
<p>&#x800C;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x6709;&#xFF1A;</p>
<ul>
<li>&#x7CBE;&#x7075;&#x7684;&#x663E;&#x793A;&#x5982;&#x4F55;&#x5206;&#x6E05;&#x695A;&#x54EA;&#x4E2A;&#x5148;&#x6E32;&#x67D3;&#x54EA;&#x4E2A;&#x540E;&#x6E32;&#x67D3;&#xFF08;&#x6E32;&#x67D3;&#x5C42;&#x6B21;&#xFF09;</li>
<li>&#x6BCF;&#x6B21;&#x64AD;&#x653E;&#x7279;&#x6548;&#x90FD;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x7269;&#x4F53;&#x7136;&#x540E;&#x9500;&#x6BC1;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x70B9;&#x6D6A;&#x8D39;&#x5185;&#x5B58;&#xFF0C;&#x53EF;&#x4E0D;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x751F;&#x6210;&#x591A;&#x4E2A;&#x91CD;&#x590D;&#x5229;&#x7528;&#xFF08;&#x5F15;&#x5165;&#x4E86;&#x5BF9;&#x8C61;&#x6C60;&#xFF09;</li>
<li>&#x5B58;&#x6863;&#x65F6;&#x5019;&#x5982;&#x679C;A&#x5199;&#x5165;&#x5B58;&#x6863;&#x8FD8;&#x6CA1;&#x7ED3;&#x675F;&#x65F6;&#x5019;B&#x53C8;&#x5199;&#x5165;&#x5B58;&#x6863;&#x4F1A;&#x4E0D;&#x4F1A;&#x51FA;&#x95EE;&#x9898;&#xFF08;&#x5F15;&#x5165;&#x4E86;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x5355;&#x4F8B;&#xFF09;</li>
</ul>
<h2 id="&#x4E0D;&#x8981;&#x6267;&#x7740;&#x4E8E;opengl">&#x4E0D;&#x8981;&#x6267;&#x7740;&#x4E8E;Opengl</h2>
<p>&#x6E38;&#x620F;&#x884C;&#x4E1A;&#x6BD4;&#x8F83;&#x6D41;&#x884C;&#x56FE;&#x5F62;&#x5B66;&#xFF0C;&#x53EF;&#x80FD;&#x611F;&#x89C9;&#x8D77;&#x6765;&#x9AD8;&#x8FBE;&#x4E0A;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x521D;&#x5B66;&#x8005;&#xFF08;&#x975E;&#x521D;&#x5B66;&#x8005;&#x5176;&#x5B9E;&#x4E5F;&#x4E00;&#x6837;&#xFF09;&#x6765;&#x8BF4;&#x66F4;&#x591A;&#x8FD8;&#x662F;&#x5E94;&#x8BE5;&#x4E13;&#x6CE8;&#x4E8E;GamePlay&#x3002;</p>
<p>&#x6211;&#x5728;&#x521A;&#x5F00;&#x59CB;&#x5199;&#x4EE3;&#x7801;&#x6CA1;&#x591A;&#x4E45;&#x5C31;&#x8DD1;&#x53BB;&#x62FF;&#x672C;opengl&#x7EA2;&#x5B9D;&#x4E66;&#x5728;&#x5543;&#xFF0C;&#x5199;&#x4E86;&#x4E00;&#x5806;&#x4EE3;&#x7801;&#x5230;&#x5934;&#x6765;&#x4E5F;&#x6CA1;&#x5B66;&#x5230;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x4E00;&#x5F00;&#x59CB;&#x4E0D;&#x8981;&#x8003;&#x8651;3D&#x65B9;&#x9762;&#x4E1C;&#x897F;&#xFF0C;&#x4ECE;&#x7B80;&#x5355;&#x7684;2d&#x5F00;&#x59CB;&#x6BD4;&#x8F83;&#x4E0D;&#x9519;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x66F4;&#x591A;&#x63A8;&#x8350;&#x770B;&#x4E0B;<a href="https://book.douban.com/subject/26264736/" target="_blank">&#x4EE3;&#x7801;&#x672C;&#x8272;</a>&#x548C;<a href="https://book.douban.com/subject/19930152/" target="_blank">&#x6E38;&#x620F;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;</a>&#x6765;&#x953B;&#x70BC;&#x4E00;&#x4E0B;&#x4EE3;&#x7801;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x751A;&#x81F3;&#x5982;&#x679C;&#x8981;&#x5B66;&#x56FE;&#x5F62;&#x5B66;Shader&#x7684;&#xFF0C;&#x6211;&#x66F4;&#x591A;&#x5EFA;&#x8BAE;&#x662F;&#x5148;&#x76F4;&#x63A5;&#x7528;Unity&#x4E0A;&#x9762;&#x5148;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x5199;&#x4E00;&#x4E9B;Shader(&#x63A8;&#x8350;<a href="https://book.douban.com/subject/26220253//" target="_blank">Unity&#x7740;&#x8272;&#x5668;&#x548C;&#x5C4F;&#x5E55;&#x7279;&#x6548;&#x5F00;&#x53D1;&#x79D8;&#x7B08;</a>)&#xFF0C;&#x80FD;&#x5199;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x7279;&#x6548;&#x4E4B;&#x540E;&#x7136;&#x540E;&#x518D;&#x56DE;&#x5934;&#x53BB;&#x5199;&#x90A3;&#x4E9B;&#x6E32;&#x67D3;&#x7BA1;&#x7EBF;Opengl&#x90A3;&#x4E9B;&#x4F1A;&#x6BD4;&#x8F83;&#x6709;&#x611F;&#x89E6;&#x3002;</p>
<h2 id="&#x4E0D;&#x8981;&#x7981;&#x9522;&#x5728;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x4E2D;">&#x4E0D;&#x8981;&#x7981;&#x9522;&#x5728;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x4E2D;</h2>
<p>&#x73B0;&#x5728;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#xFF0C;&#x5199;&#x8F6F;&#x4EF6;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x4F7F;&#x5176;&#x8D8A;&#x6765;&#x8D8A;&#x5BB9;&#x6613;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x4F46;&#x4E00;&#x76F4;&#x4F7F;&#x7528;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x5BF9;&#x4E8E;&#x521D;&#x5B66;&#x7F16;&#x7A0B;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#x4F1A;&#x6BD4;&#x8F83;&#x96BE;&#x4EE5;&#x63D0;&#x9AD8;&#x7F16;&#x7A0B;&#x6C34;&#x5E73;&#x3002;&#x4E2A;&#x4EBA;&#x5EFA;&#x8BAE;&#x662F;&#x53EF;&#x4EE5;&#x4ECE;&#x5148;&#x4ECE;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x5165;&#x95E8;&#xFF0C;&#x7136;&#x540E;&#x5C1D;&#x8BD5;&#x4E0D;&#x4F7F;&#x7528;&#x5F15;&#x64CE;&#x4F7F;&#x7528;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x4E00;&#x4E9B;&#x5E95;&#x5C42;&#x70B9;&#x7684;&#x6846;&#x67B6;&#x6216;&#x8005;&#x5DE5;&#x5177;&#x6765;&#x5236;&#x4F5C;&#x6E38;&#x620F;&#x3002;</p>
<h2 id="&#x9020;&#x70B9;&#x5C0F;&#x8F6E;&#x5B50;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x9AD8;">&#x9020;&#x70B9;&#x5C0F;&#x8F6E;&#x5B50;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x9AD8;</h2>
<p>&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x8BF4;&#x4E0D;&#x8981;&#x91CD;&#x590D;&#x9020;&#x8F6E;&#x5B50;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x522B;&#x4EBA;&#x7684;&#x8F6E;&#x5B50;&#x6BD4;&#x8F83;&#x91CD;&#x91CF;&#x7EA7;&#x4E0D;&#x591F;&#x8F7B;&#x3002;&#x81EA;&#x5DF1;&#x5199;&#x70B9;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x8F6E;&#x5B50;&#x4E5F;&#x5BF9;&#x81EA;&#x5DF1;&#x7F16;&#x7A0B;&#x80FD;&#x529B;&#x6709;&#x4E00;&#x5B9A;&#x63D0;&#x9AD8;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x66F4;&#x591A;&#x4EAB;&#x53D7;&#x7F16;&#x7A0B;&#x7684;&#x4E50;&#x8DA3;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x7528;&#x4E0A;&#x6587;&#x63D0;&#x5230;&#x7684;&#x6BD4;&#x8F83;&#x5E95;&#x5C42;&#x7684;&#x6846;&#x67B6;&#xFF08;&#x6BD4;&#x5982;SDL&#xFF09;&#x6765;&#x5236;&#x4F5C;&#x6E38;&#x620F;&#x7136;&#x540E;&#x81EA;&#x5DF1;&#x5199;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5730;&#x56FE;&#x7F16;&#x8F91;&#x5668;&#x3001;&#x7C92;&#x5B50;&#x7CFB;&#x7EDF;&#x3001;&#x5B58;&#x6863;&#x6587;&#x4EF6;&#x4FDD;&#x5B58;&#x8BFB;&#x53D6;&#x7CFB;&#x7EDF;&#x6216;&#x8005;&#x83DC;&#x5355;&#x7CFB;&#x7EDF;&#x3002;&#x867D;&#x7136;&#x4F60;&#x505A;&#x7684;&#x8FD9;&#x4E2A;&#x8DDF;&#x4E13;&#x4E1A;&#x5F15;&#x64CE;&#x5236;&#x4F5C;&#x7684;&#x6CA1;&#x6CD5;&#x6BD4;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x5929;&#x4F60;&#x56DE;&#x5230;&#x5F15;&#x64CE;&#x91CC;&#x518D;&#x6765;&#x770B;&#x5F85;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x4F1A;&#x6709;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x89E3;&#x51B3;&#x601D;&#x8DEF;&#x3002;</p>
<h2 id="&#x6CE8;&#x610F;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x5E94;&#x7528;">&#x6CE8;&#x610F;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x5E94;&#x7528;</h2>
<p>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x521A;&#x5B66;&#x4E60;&#x65F6;&#x5019;&#x4F1A;&#x9677;&#x5165;&#x8FD9;&#x4E1C;&#x897F;&#x5728;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x4E2D;&#x80FD;&#x5E72;&#x4EC0;&#x4E48;&#x7684;&#x7591;&#x60D1;&#x4E4B;&#x4E2D;&#x3002;&#x9664;&#x4E86;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x5BFB;&#x8DEF;&#x7528;&#x5230;&#x56FE;&#x548C;&#x7F51;&#x7EDC;&#x7F16;&#x7A0B;&#x7684;&#x6D88;&#x606F;&#x961F;&#x5217;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x5728;&#x6211;&#x4E00;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x65F6;&#x5019;&#x90FD;&#x4E00;&#x65E0;&#x6240;&#x77E5;&#x3002;</p>
<p><strong>&#x5806;&#x6808;&#x7684;&#x5E94;&#x7528;</strong>&#xFF1A;&#x5728;&#x5904;&#x7406;&#x83DC;&#x5355;&#x65F6;&#x5019;&#x6BD4;&#x5982;&#x8FDB;&#x5165;&#x8BBE;&#x7F6E;&#x83DC;&#x5355;&#x65F6;&#x5019;&#x628A;&#x65B0;&#x83DC;&#x5355;&#x538B;&#x6808;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD4;&#x56DE;&#x65F6;&#x5019;&#x51FA;&#x6808;&#x9500;&#x6BC1;&#x5373;&#x53EF;&#x3002;&#x5728;&#x6E38;&#x620F;&#x573A;&#x666F;&#x8FDB;&#x5165;&#x5230;&#x4E00;&#x4E2A;&#x623F;&#x95F4;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x628A;&#x5F53;&#x524D;&#x6E38;&#x620F;&#x573A;&#x666F;&#x6682;&#x505C;&#x7136;&#x540E;&#x628A;&#x65B0;&#x7684;&#x623F;&#x95F4;&#x573A;&#x666F;&#x538B;&#x6808;&#x3002;</p>
<p><strong>&#x961F;&#x5217;&#x7684;&#x5E94;&#x7528;</strong>&#xFF1A;&#x5728;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x7F13;&#x51B2;&#x8F93;&#x5165;&#x65F6;&#x5019;&#xFF08;&#x6BD4;&#x5982;&#x683C;&#x6597;&#x6E38;&#x620F;&#xFF09;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x961F;&#x5217;&#x6765;&#x63A7;&#x5236;&#x8F93;&#x5165;&#x64CD;&#x4F5C;&#x3002;&#x5728;&#x4E00;&#x4E9B;&#x6280;&#x80FD;&#x7CFB;&#x7EDF;&#x6BD4;&#x5982;&#x4E00;&#x56DE;&#x5408;&#x6709;8&#x4E2A;&#x4F53;&#x529B;&#x69FD;&#x73A9;&#x5BB6;&#x6765;&#x7EC4;&#x5408;&#x653B;&#x51FB;&#x3002;&#x5728;&#x5236;&#x4F5C;&#x56DE;&#x653E;&#x7CFB;&#x7EDF;&#x65F6;&#x5019;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x961F;&#x5217;&#x6765;&#x5236;&#x4F5C;&#x3002;</p>
<p><strong>&#x6811;&#x7684;&#x5E94;&#x7528;</strong>&#xFF1A;&#x57FA;&#x672C;&#x662F;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x9762;&#x5BF9;&#x5206;&#x652F;&#x800C;&#x4E14;&#x6BCF;&#x4E2A;&#x5206;&#x652F;&#x90FD;&#x6709;&#x5206;&#x652F;&#x65F6;&#x5019;&#x9700;&#x8981;&#x8003;&#x8651;&#x3002;&#x5178;&#x578B;&#x7684;&#x6BD4;&#x5982;&#x5267;&#x60C5;&#x6216;&#x8005;&#x5BF9;&#x8BDD;&#x6811;&#xFF0C;&#x5728;&#x8282;&#x70B9;&#x4E0B;&#x6709;&#x5F88;&#x591A;&#x5B50;&#x7269;&#x4F53;&#xFF0C;&#x5B50;&#x7269;&#x4F53;&#x53C8;&#x53EF;&#x4EE5;&#x6709;&#x5F88;&#x591A;&#x5B50;&#x7269;&#x4F53;&#x65F6;&#x5019;&#x4E5F;&#x662F;&#x5B83;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x3002;</p>
<p><strong>&#x56FE;&#x7684;&#x5E94;&#x7528;</strong>&#xFF1A;&#x5728;&#x53EF;&#x89C6;&#x5316;&#x6D41;&#x7A0B;&#x63A7;&#x5236;&#xFF0C;&#x6709;&#x9650;&#x72B6;&#x6001;&#x673A;&#x548C;&#x5BFC;&#x822A;&#x7CFB;&#x7EDF;&#x90FD;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x5B83;&#x7684;&#x5F71;&#x5B50;&#x3002;</p>
<h2 id="&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5E94;&#x7528;">&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5E94;&#x7528;</h2>
<p>&#x8FD9;&#x4E2A;&#x5176;&#x5B9E;&#x6709;&#x4E13;&#x95E8;&#x4E66;&#x7C4D;&#x8FDB;&#x884C;&#x9610;&#x8FF0;&#xFF0C; &#x6211;&#x4E5F;&#x53EA;&#x662F;&#x73ED;&#x95E8;&#x5F04;&#x65A7;&#x800C;&#x5DF2; &#xFF0C;&#x6211;&#x53EA;&#x8C08;&#x8BBA;&#x51E0;&#x4E2A;&#x5BF9;&#x4E8E;&#x6211;&#x521D;&#x5B66;&#x65F6;&#x5019;&#x6BD4;&#x8F83;&#x6709;&#x6536;&#x83B7;&#x7684;&#x3002;</p>
<p><strong>&#x5355;&#x4F8B;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x521A;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x65F6;&#x5019;&#x90FD;&#x4F1A;&#x9762;&#x4E34;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x573A;&#x666F;&#x5207;&#x6362;&#x4E0D;&#x9500;&#x6BC1;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x63A8;&#x8350;&#x7684;&#x505A;&#x6CD5;&#x4E5F;&#x662F;&#x4E00;&#x4E9B;&#x521D;&#x5B66;&#x8005;&#x4F1A;&#x72AF;&#x7684;&#x662F;&#x628A;&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x5230;&#x672C;&#x5730;&#xFF0C;&#x7136;&#x540E;&#x4E0B;&#x4E2A;&#x573A;&#x666F;&#x518D;&#x8BFB;&#x53D6;&#x3002;&#x8FD9;&#x79CD;&#x76F4;&#x63A5;&#x8FDB;&#x884C;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x662F;&#x4E0D;&#x53EF;&#x53D6;&#x800C;&#x4E14;&#x5F53;&#x4F60;&#x8981;&#x4FDD;&#x5B58;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x6E38;&#x620F;&#x5BF9;&#x8C61;&#xFF08;GameObject&#xFF09;&#x65F6;&#x5019;&#x5C31;&#x6CA1;&#x529E;&#x6CD5;&#x4E86;&#xFF08;&#x5F53;&#x7136;&#x5176;&#x5B9E;&#x4E5F;&#x53EF;&#x4EE5;&#x5E8F;&#x5217;&#x5316;&#x5BF9;&#x8C61;&#x4FDD;&#x5B58;&#x5230;&#x672C;&#x5730;&#x4F46;&#x4ECD;&#x7136;&#x4E0D;&#x53EF;&#x53D6;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6BD4;&#x8F83;&#x53EF;&#x53D6;&#x7684;&#x5C31;&#x662F;&#x4FDD;&#x5B58;&#x5230;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684;&#x9759;&#x6001;&#x5BF9;&#x8C61;/&#x53D8;&#x91CF;&#x4E0A;&#xFF0C;&#x8FD9;&#x5C31;&#x5F15;&#x5165;&#x4E86;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x3002;&#x8FD8;&#x6709;&#x6BD4;&#x5982;&#x4E00;&#x4E9B;&#x7CFB;&#x7EDF;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x5165;&#x53E3;&#x4E0D;&#x5141;&#x8BB8;&#x968F;&#x4FBF;&#x4F7F;&#x7528;&#x4E0D;&#x7136;&#x4F1A;&#x51FA;&#x9519;&#xFF0C;&#x6BD4;&#x5982;&#x5178;&#x578B;&#x7684;&#x6587;&#x4EF6;IO&#x548C;&#x63A7;&#x5236;&#x5668;&#x8F93;&#x5165;&#x63A7;&#x5236;&#x3002;</p>
<p><strong>&#x6570;&#x636E;&#x9A71;&#x52A8;</strong>&#xFF1A;&#x5728;Unity&#x7684;ScriptObject&#x4E2D;&#x660E;&#x663E;&#x5C31;&#x662F;&#x6570;&#x636E;&#x9A71;&#x52A8;&#xFF0C;&#x5176;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x5C31;&#x662F;<strong>&#x6539;&#x52A8;&#x6570;&#x636E;&#x800C;&#x4E0D;&#x5FC5;&#x6539;&#x52A8;&#x4EE3;&#x7801;</strong>&#x3002;&#x800C;&#x5F53;&#x4F60;&#x8981;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x9A71;&#x52A8;&#x65F6;&#x5019;&#x4E00;&#x5B9A;&#x8981;&#x5206;&#x6E05;&#x695A;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x786C;&#x7F16;&#x7801;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x6570;&#x636E;&#x9A71;&#x52A8;&#xFF0C;&#x914D;&#x7F6E;&#x592A;&#x591A;&#x7684;&#x8BDD;&#x662F;&#x5F88;&#x5F71;&#x54CD;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x548C;&#x53EF;&#x9605;&#x8BFB;&#x6027;&#x3002;</p>
<p><strong>&#x964D;&#x4F4E;&#x6307;&#x9488;&#x8DF3;&#x8F6C;&#x6D88;&#x8017;</strong>&#xFF1A;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x4E5F;&#x662F;<a href="https://en.wikipedia.org/wiki/Entity_component_system" target="_blank">ECS</a>&#x63D0;&#x51FA;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#xFF0C;&#x5728;&#x5927;&#x578B;&#x6E38;&#x620F;&#x4E2D;&#x9762;&#x5BF9;&#x7684;&#x662F;&#x5DE8;&#x91CF;&#x7684;&#x6E38;&#x620F;&#x7269;&#x4F53;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6E38;&#x620F;&#x7269;&#x4F53;&#x4E2D;&#x53C8;&#x6709;&#x5404;&#x79CD;&#x6307;&#x9488;&#x8DF3;&#x8F6C;&#x7684;&#x8BDD;&#x9020;&#x6210;&#x7684;&#x6027;&#x80FD;&#x6D88;&#x8017;&#x5C31;&#x4E0D;&#x80FD;&#x5FFD;&#x89C6;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x5019;&#x8981;&#x6CE8;&#x610F;&#x964D;&#x4F4E;&#x6307;&#x9488;&#x8DF3;&#x8F6C;&#xFF0C;&#x5C3D;&#x91CF;&#x8BA9;&#x5185;&#x5B58;&#x8FDE;&#x7EED;&#x5206;&#x5E03;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528;&#x7ED3;&#x6784;&#x4F53;&#x548C;&#x6570;&#x7EC4;&#x3002;&#x5F53;&#x7136;&#x5185;&#x5B58;&#x8FDE;&#x7EED;&#x5206;&#x5E03;&#x4E5F;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x788E;&#x7247;&#x3002;</p>
<p><strong>&#x514B;&#x9686;&#x6A21;&#x5F0F;</strong>&#xFF1A;&#x8FD9;&#x4E2A;&#x4E00;&#x5F00;&#x59CB;&#x597D;&#x50CF;&#x662F;&#x5728;Cocos2d-x&#x91CC;&#x9762;&#x770B;&#x5230;&#x8FC7;&#xFF0C;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x6765;&#x5B9E;&#x73B0;&#x514B;&#x9686;&#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x6E38;&#x620F;&#x4E2D;&#x5176;&#x5B9E;&#x4E5F;&#x633A;&#x5E38;&#x89C1;&#xFF0C;&#x6BD4;&#x5982;GBA&#x7684;&#x6728;&#x53F6;&#x6218;&#x8BB0;&#x4E2D;&#xFF0C;&#x9E23;&#x4EBA;&#x4F7F;&#x7528;&#x5F71;&#x5206;&#x8EAB;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4EBA;&#x7269;&#x4F46;&#x662F;&#x653B;&#x51FB;&#x529B;&#x548C;&#x8840;&#x91CF;&#x51CF;&#x534A;&#x3002;&#x5728;Unity&#x4E2D;Prefab&#x4ECE;Project&#x7A97;&#x53E3;&#x62D6;&#x52A8;&#x5230;Scene&#x4E2D;&#x65F6;&#x5019;&#x4E5F;&#x662F;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x601D;&#x8DEF;&#xFF08;&#x5E94;&#x8BE5;&#x5427;&#xFF09;&#x3002;</p>
<h2 id="&#x6CE8;&#x610F;&#x4EE3;&#x7801;&#x6574;&#x6D01;">&#x6CE8;&#x610F;&#x4EE3;&#x7801;&#x6574;&#x6D01;</h2>
<p>&#x8FD9;&#x4E2A;&#x66F4;&#x591A;&#x662F;&#x7ECF;&#x9A8C;&#x6027;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x4E5F;&#x96BE;&#x8BF4;&#x505A;&#x5F97;&#x5F88;&#x597D;&#x3002;&#x4FDD;&#x6301;&#x4EE3;&#x7801;&#x53EF;&#x8BFB;&#x6027;&#x662F;&#x4E3A;&#x4E86;&#x65E5;&#x540E;&#x4F60;&#x6216;&#x8005;&#x522B;&#x4EBA;&#x56DE;&#x6765;&#x770B;&#x4EE3;&#x7801;&#x80FD;&#x770B;&#x5F97;&#x61C2;&#x3002;&#x4FDD;&#x6301;&#x51FD;&#x6570;&#x7684;&#x5355;&#x4E00;&#x804C;&#x8D23;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x5F53;&#x4F60;&#x53D1;&#x73B0;&#x6709;&#x4E9B;&#x4EE3;&#x7801;&#x91CD;&#x590D;&#x5199;&#x4E86;&#x51E0;&#x6B21;&#x5C31;&#x5E94;&#x8BE5;&#x601D;&#x8003;&#x8FD9;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x3002;&#x4F60;&#x5FC5;&#x987B;&#x660E;&#x767D;&#x7684;&#x662F;Bug&#x603B;&#x662F;&#x4F1A;&#x6709;&#x7684;&#xFF0C;&#x603B;&#x6709;&#x4E00;&#x5929;&#x4F60;&#x6216;&#x8005;&#x522B;&#x4EBA;&#x4F1A;&#x91CD;&#x65B0;&#x770B;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x5199;&#x7684;&#x65F6;&#x5019;&#x7A0D;&#x52A0;&#x6CE8;&#x610F;&#xFF0C;&#x540E;&#x671F;&#x7684;&#x7EF4;&#x62A4;&#x548C;&#x590D;&#x7528;&#x5C31;&#x4F1A;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#x8F7B;&#x677E;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x53EF;&#x4EE5;&#x770B;&#x4E0B;<a href="https://book.douban.com/subject/1477390/" target="_blank">&#x4EE3;&#x7801;&#x5927;&#x5168;</a>&#x3001;<a href="https://book.douban.com/subject/4199741/" target="_blank">&#x4EE3;&#x7801;&#x6574;&#x6D01;&#x4E4B;&#x9053;</a>&#x548C;<a href="https://www.bilibili.com/video/av33363131/" target="_blank">&#x8FD9;&#x4E2A;&#x89C6;&#x9891;</a>&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5236;&#x4F5C;&#x6E38;&#x620F;&#x5F88;&#x6709;&#x8DA3;&#xFF0C;&#x5199;&#x6E38;&#x620F;&#x4EE3;&#x7801;&#x4E5F;&#x5F88;&#x5F00;&#x5FC3;&#xFF0C;&#x5E0C;&#x671B;&#x4F60;&#x4E5F;&#x80FD;&#x4EAB;&#x53D7;&#x6E38;&#x620F;&#x7F16;&#x7A0B;&#x7684;&#x5FEB;&#x4E50;&#xFF01;</p>
<h2 id="&#x63A8;&#x8350;&#x4E66;&#x7C4D;">&#x63A8;&#x8350;&#x4E66;&#x7C4D;</h2>
<p><a href="https://book.douban.com/subject/27021785/" target="_blank">&#x6E38;&#x620F;&#x8BBE;&#x8BA1;&#x3001;&#x539F;&#x578B;&#x4E0E;&#x5F00;&#x53D1;</a></p>
<p><a href="https://book.douban.com/subject/3433594/" target="_blank">Data Structures for Game Programmers</a></p>
<p><a href="https://gpp.tkchu.me/" target="_blank">&#x6E38;&#x620F;&#x7F16;&#x7A0B;&#x6A21;&#x5F0F;</a></p>
<p><a href="https://book.douban.com/subject/1477390/" target="_blank">&#x4EE3;&#x7801;&#x5927;&#x5168;</a></p>
<p><a href="https://book.douban.com/subject/4199741/" target="_blank">&#x4EE3;&#x7801;&#x6574;&#x6D01;&#x4E4B;&#x9053;</a></p>
<p><a href="https://book.douban.com/subject/19930152/" target="_blank">&#x6E38;&#x620F;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7F16;&#x7A0B;&#x6848;&#x4F8B;&#x7CBE;&#x7CB9;</a></p>
<p><a href="https://book.douban.com/subject/26264736/" target="_blank">&#x4EE3;&#x7801;&#x672C;&#x8272;&#xFF1A;&#x7528;&#x7F16;&#x7A0B;&#x6A21;&#x62DF;&#x81EA;&#x7136;&#x7CFB;&#x7EDF;</a></p>
<p><a href="https://book.douban.com/subject/10541091/" target="_blank">Game Coding Complete</a></p>
<p><a href="https://book.douban.com/subject/25779461/" target="_blank">Game Programming Algorithms and Techniques</a></p>
<p><a href="https://book.douban.com/subject/2049386/" target="_blank">Shaders for Game Programmers and Artists</a></p>
<p><a href="https://book.douban.com/subject/26220253//" target="_blank">Unity&#x7740;&#x8272;&#x5668;&#x548C;&#x5C4F;&#x5E55;&#x7279;&#x6548;&#x5F00;&#x53D1;&#x79D8;&#x7B08;</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 序">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="IndieGameDevTutorial.html" class="navigation navigation-next " aria-label="Next page: 独立游戏开发入门指南">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"游戏编程入门指南","level":"1.2","depth":1,"next":{"title":"独立游戏开发入门指南","level":"1.3","depth":1,"path":"IndieGameDevTutorial.md","ref":"IndieGameDevTutorial.md","articles":[]},"previous":{"title":"序","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"GameProgramTutorial.md","mtime":"2020-02-27T07:18:52.654Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-02-27T07:47:30.210Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

