
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>独立游戏开发入门指南 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="EditorTutorial.html" />
    
    
    <link rel="prev" href="GameProgramTutorial.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="GameProgramTutorial.html">
            
                <a href="GameProgramTutorial.html">
            
                    
                    游戏编程入门指南
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="IndieGameDevTutorial.html">
            
                <a href="IndieGameDevTutorial.html">
            
                    
                    独立游戏开发入门指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="EditorTutorial.html">
            
                <a href="EditorTutorial.html">
            
                    
                    Unity拓展编辑器入门指南
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="MakingOfIPixFont.html">
            
                <a href="MakingOfIPixFont.html">
            
                    
                    IPix中文像素字体制作
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >独立游戏开发入门指南</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x4ECE;&#x5F00;&#x59CB;&#x5F00;&#x53D1;&#x6E38;&#x620F;&#x5230;&#x73B0;&#x5728;&#x5927;&#x6982;&#x6709;&#x4E94;&#x5E74;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x5728;&#x60F3;&#x5982;&#x679C;&#x73B0;&#x5728;&#x7ED9;&#x8FC7;&#x53BB;&#x7684;&#x81EA;&#x5DF1;&#x4E00;&#x70B9;&#x5EFA;&#x8BAE;&#x4E5F;&#x8BB8;&#x80FD;&#x6709;&#x4E00;&#x70B9;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8FD9;&#x7BC7;&#x65E5;&#x5FD7;&#x4E3B;&#x8981;&#x662F;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x5BF9;&#x4E8E;&#x72EC;&#x7ACB;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x5165;&#x95E8;&#x7684;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x3002;</p>
<h2 id="&#x5F15;&#x64CE;&#x9009;&#x62E9;">&#x5F15;&#x64CE;&#x9009;&#x62E9;</h2>
<p>&#x5728;&#x9009;&#x62E9;&#x5F15;&#x64CE;&#x65F6;&#x5019;&#x4E3B;&#x8981;&#x8003;&#x8651;&#x7684;&#x5927;&#x65B9;&#x5411;&#x662F;&#xFF1A;<strong>&#x4E3A;&#x4E86;&#x65E5;&#x540E;&#x627E;&#x4EFD;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;</strong>&#x8FD8;&#x662F;<strong>&#x5355;&#x7EAF;&#x505A;&#x4E2A;&#x6E38;&#x620F;</strong>&#x3002;</p>
<h3 id="&#x627E;&#x4EFD;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;">&#x627E;&#x4EFD;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;</h3>
<p>&#x5982;&#x679C;&#x662F;&#x76EE;&#x6807;&#x662F;&#x5B66;&#x4E60;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x8FDB;&#x5165;&#x6E38;&#x620F;&#x884C;&#x4E1A;&#x627E;&#x4EFD;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x76EE;&#x524D;&#x56FD;&#x5185;&#x63A8;&#x8350;&#x7684;&#x53EA;&#x6709;&#x51E0;&#x4E2A;&#xFF1A;<a href="https://unity.com/" target="_blank">Unity</a>&#x3001;<a href="https://www.unrealengine.com/" target="_blank">&#x865A;&#x5E7B;4</a>&#x548C;&#x56FD;&#x5185;&#x4E00;&#x4E9B;H5&#x5F15;&#x64CE;&#x3002;&#x5173;&#x4E8E;&#x8FD9;&#x4E9B;&#x5F15;&#x64CE;&#x9664;&#x4E86;Unity&#x4EE5;&#x5916;&#x6211;&#x4E86;&#x89E3;&#x4E0D;&#x591A;&#x800C;&#x4E14;&#x4E5F;&#x5F88;&#x591A;&#x4EBA;&#x4E5F;&#x90FD;&#x4ECB;&#x7ECD;&#x8FC7;&#x4E86;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#x76EE;&#x524D;&#x7528;&#x5F97;&#x6700;&#x591A;&#x7684;&#x4EBA;&#x7FA4;&#x5C31;&#x662F;Unity&#x548C;&#x865A;&#x5E7B;&#xFF0C;&#x800C;&#x4E2A;&#x4EBA;&#x4E0A;&#x624B;&#x6765;&#x770B;&#x8FD9;&#x4FE9;&#x5F15;&#x64CE;&#x90FD;&#x6BD4;&#x8F83;&#x91CD;&#xFF0C;&#x4E0D;&#x591F;&#x8F7B;&#x4FBF;&#x4E5F;&#x4E0D;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x4E0A;&#x624B;&#x3002;</p>
<h3 id="&#x5355;&#x7EAF;&#x505A;&#x4E2A;&#x6E38;&#x620F;"><strong>&#x5355;&#x7EAF;&#x505A;&#x4E2A;&#x6E38;&#x620F;</strong></h3>
<p>&#x5982;&#x679C;&#x662F;&#x5355;&#x7EAF;&#x505A;&#x4E2A;&#x6E38;&#x620F;&#xFF0C;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#x7684;&#x5F15;&#x64CE;&#x5C31;&#x6709;&#x5F88;&#x591A;&#x3002;</p>
<p>&#x50CF;<a href="https://store.steampowered.com/app/736260/Baba_Is_You/" target="_blank">Baba is you</a>&#x5C31;&#x662F;<a href="https://www.clickteam.com/clickteam-fusion-2-5" target="_blank">Click Fusion</a>&#x5F15;&#x64CE;&#xFF0C;<a href="http://www.celestegame.com/" target="_blank">Celeste</a>&#x3001;<a href="https://store.steampowered.com/app/224760/FEZ/" target="_blank">FEZ</a>&#x548C;<a href="https://store.steampowered.com/app/413150/Stardew_Valley" target="_blank">&#x661F;&#x9732;&#x8C37;&#x7269;&#x8BED;</a>&#x662F;<a href="http://www.monogame.net/" target="_blank">MonoGame</a>&#x5F15;&#x64CE;&#xFF0C;<a href="https://undertale.com/" target="_blank">UnderTale</a>&#x548C;<a href="http://downwellgame.com/" target="_blank">Downwell</a>&#x662F;<a href="https://www.yoyogames.com/gamemaker" target="_blank">GameMaker</a>&#xFF0C;<a href="https://store.steampowered.com/app/1091250/Total_Party_Kill/" target="_blank">Total Party Kill</a>&#x5219;&#x662F;&#x4F7F;&#x7528;<a href="http://www.stencyl.com/" target="_blank">Stencyl</a>&#x3002;</p>
<p><strong>&#x8FD9;&#x91CC;&#x53EA;&#x8BA8;&#x8BBA;2D&#x6E38;&#x620F;&#xFF0C;&#x6211;&#x5BF9;3D&#x6CA1;&#x4EC0;&#x4E48;&#x5174;&#x8DA3;</strong>&#x3002;</p>
<p>&#x4ECE;&#x6211;&#x6478;&#x8FC7;&#x7684;&#x4E00;&#x4E9B;&#x5F15;&#x64CE;&#x6211;&#x4E3B;&#x8981;&#x5206;&#x6210;&#x4E09;&#x79CD;&#x4EBA;&#x7FA4;&#xFF1A;<strong>&#x4E0D;&#x5199;&#x4EE3;&#x7801;&#x8981;&#x5D29;&#x6E83;</strong>&#x3001;<strong>&#x5199;&#x4EE3;&#x7801;&#x8981;&#x5D29;&#x6E83;&#x7684;</strong>&#x5F00;&#x53D1;&#x8005;&#x548C;<strong>&#x4E2D;&#x7ACB;</strong>&#x7684;&#x5F00;&#x53D1;&#x8005;</p>
<h4 id="&#x4E0D;&#x5199;&#x4EE3;&#x7801;&#x8981;&#x5D29;&#x6E83;&#x7684;&#x5F00;&#x53D1;&#x8005;">&#x4E0D;&#x5199;&#x4EE3;&#x7801;&#x8981;&#x5D29;&#x6E83;&#x7684;&#x5F00;&#x53D1;&#x8005;</h4>
<p>&#x5F88;&#x591A;&#x4EBA;&#x5C31;&#x559C;&#x6B22;&#x5199;&#x4EE3;&#x7801;&#x4E5F;&#x559C;&#x6B22;&#x505A;&#x6E38;&#x620F;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x4EBA;&#x4E0D;&#x559C;&#x6B22;&#x62D6;&#x6765;&#x62D6;&#x53BB;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x7F16;&#x7A0B;&#x754C;&#x9762;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x4ED6;&#x4EEC;&#x66F4;&#x559C;&#x6B22;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x4E2A;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x4E0D;&#x559C;&#x6B22;&#x6709;&#x5404;&#x79CD;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x5F15;&#x64CE;&#x3002;&#x9762;&#x5BF9;&#x8FD9;&#x7C7B;&#x5F00;&#x53D1;&#x8005;&#x548C;&#x5B66;&#x4E60;&#x8005;&#x66F4;&#x591A;&#x63A8;&#x8350;&#x7684;&#x662F;&#xFF1A;<a href="https://www.lexaloffle.com/pico-8.php" target="_blank">pico-8</a>&#x3001;<a href="https://phaser.io/" target="_blank">Phaser</a>&#x548C;MonoGame&#x3002;</p>
<p>&#x8FD9;&#x51E0;&#x4E2A;&#x90FD;&#x662F;&#x6BD4;&#x8F83;&#x8003;&#x9A8C;&#x7F16;&#x7A0B;&#x80FD;&#x529B;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x51E0;&#x4E2A;&#x5F15;&#x64CE;&#x5BF9;&#x914D;&#x7F6E;&#x8981;&#x6C42;&#x4E0D;&#x9AD8;&#xFF0C;&#x5199;&#x7A0B;&#x5E8F;&#x4E45;&#x4E86;&#x4E00;&#x822C;&#x90FD;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x8F7B;&#x4FBF;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x5728;&#x6211;&#x521A;&#x5165;&#x95E8;&#x65F6;&#x5019;&#x73A9;&#x5F97;&#x662F;C++&#x7684;Cocos2d-x&#xFF0C;&#x7535;&#x8111;&#x5B9E;&#x5728;&#x5783;&#x573E;&#x6BCF;&#x6B21;&#x7F16;&#x8BD1;&#x8FD0;&#x884C;&#x90FD;&#x5F88;&#x70E6;&#xFF0C;&#x4E4B;&#x540E;&#x7528;Unity&#x4FEE;&#x6539;&#x4E00;&#x4E0B;&#x7F16;&#x8BD1;&#x4E5F;&#x662F;&#x5F88;&#x6162;&#xFF0C;&#x505A;&#x6E38;&#x620F;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x5F00;&#x5FC3;&#xFF0C;&#x7ED3;&#x679C;&#x8FD9;&#x6837;&#x5F88;&#x5F71;&#x54CD;&#x5F00;&#x53D1;&#x5FC3;&#x60C5;&#x3002;</p>
<p><strong>pico-8</strong>&#x9650;&#x5236;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x8A00;&#x4F7F;&#x7528;&#x7684;&#x7C7B;&#x4F3C;<strong>Lua</strong>&#x7684;&#x8BED;&#xFF0C;&#x6BD4;&#x8F83;&#x5C0F;&#x5DE7;&#xFF0C;&#x5185;&#x7F6E;&#x4E86;<strong>&#x5730;&#x56FE;&#x7F16;&#x8F91;&#x5668;</strong>&#x548C;<strong>&#x97F3;&#x4E50;&#x97F3;&#x6548;&#x7F16;&#x8F91;&#x5668;</strong>&#xFF0C;&#x800C;&#x4E14;8&#x4F4D;&#x590D;&#x53E4;&#x98CE;&#x5BF9;&#x4ECE;8&#x4F4D;&#x673A;&#x8FC7;&#x6765;&#x7684;&#x73A9;&#x5BB6;&#x5F88;&#x6CA1;&#x6709;&#x62B5;&#x6297;&#x529B;&#x3002;</p>
<p><strong>Phaser</strong>&#x662F;&#x4F7F;&#x7528;javascript&#x7684;&#x7F51;&#x9875;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#xFF0C;&#x751A;&#x81F3;&#x8FD9;&#x4E2A;&#x5F15;&#x64CE;&#x4F60;&#x662F;&#x4E0D;&#x7528;&#x4E0B;&#x8F7D;&#x76F4;&#x63A5;&#x5728;&#x4EE3;&#x7801;&#x5F15;&#x7528;&#x4E00;&#x4E0B;&#x5C31;&#x53EF;&#x4EE5;&#x6109;&#x5FEB;&#x5F00;&#x53D1;&#x6E38;&#x620F;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x540C;&#x6837;&#x4E0D;&#x7528;&#x7F16;&#x8BD1;&#xFF0C;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x5F88;&#x5FEB;&#x3002;</p>
<p><strong>MonoGame</strong>&#x66F4;&#x591A;&#x662F;&#x4E00;&#x4E2A;C#&#x7684;&#x8DE8;&#x5E73;&#x53F0;&#x6846;&#x67B6;&#xFF0C;&#x5F88;&#x591A;&#x4E13;&#x4E1A;&#x5F00;&#x53D1;&#x8005;&#x4E5F;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x5F15;&#x64CE;&#x5236;&#x4F5C;&#x5546;&#x4E1A;&#x6E38;&#x620F;&#xFF0C;&#x867D;&#x7136;&#x9700;&#x8981;&#x7F16;&#x8BD1;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x662F;&#x5F88;&#x8F7B;&#x5F88;&#x5FEB;&#xFF01;</p>
<p>&#x50CF;&#x662F;<strong>pico-8</strong>&#x548C;<strong>phaser</strong>&#x5F15;&#x64CE;&#x8FD9;&#x79CD;&#x4E0D;&#x7528;&#x7F16;&#x8BD1;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x8F93;&#x51FA;&#x7F51;&#x9875;&#x7684;&#x5F15;&#x64CE;&#x9002;&#x5408;&#x5F88;&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#x6E38;&#x620F;&#x539F;&#x578B;&#x548C;&#x5206;&#x4EAB;&#x6E38;&#x620F;&#xFF0C;&#x800C;<strong>MonoGame</strong>&#x8FD9;&#x79CD;&#x5219;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x5236;&#x4F5C;&#x8981;&#x53D1;&#x5E03;&#x5230;&#x5546;&#x5E97;&#x7684;&#x5546;&#x4E1A;&#x6E38;&#x620F;&#x3002;</p>
<h4 id="&#x5199;&#x4EE3;&#x7801;&#x8981;&#x5D29;&#x6E83;&#x7684;&#x5F00;&#x53D1;&#x8005;">&#x5199;&#x4EE3;&#x7801;&#x8981;&#x5D29;&#x6E83;&#x7684;&#x5F00;&#x53D1;&#x8005;</h4>
<p>&#x5F88;&#x591A;&#x4EBA;&#x5C31;&#x4E0D;&#x559C;&#x6B22;&#x5199;&#x4EE3;&#x7801;&#x4F46;&#x4E5F;&#x559C;&#x6B22;&#x505A;&#x6E38;&#x620F;&#xFF0C;&#x9762;&#x5BF9;&#x8FD9;&#x7C7B;&#x5F00;&#x53D1;&#x8005;&#x66F4;&#x591A;&#x63A8;&#x8350;&#x7684;&#x662F;&#xFF1A;<a href="https://www.scirra.com/" target="_blank">Construct</a>&#x548C;Stencyl&#x3002;</p>
<p>&#x8FD9;&#x4E24;&#x4E2A;&#x90FD;&#x662F;&#x53EF;&#x89C6;&#x5316;&#x7F16;&#x7A0B;&#x5F15;&#x64CE;&#xFF0C;&#x800C;&#x4E14;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5F15;&#x64CE;&#x4E0D;&#x4E4F;&#x5F88;&#x591A;&#x5F88;&#x597D;&#x7684;&#x6E38;&#x620F;&#x3002;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E9B;&#x4EBA;&#x89C9;&#x5F97;&#x8FD9;&#x79CD;&#x5F15;&#x64CE;&#x505A;&#x51FA;&#x6765;&#x7684;&#x6E38;&#x620F;&#x4E0D;&#x662F;&#x5F88;&#x5389;&#x5BB3;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x4F5C;&#x4E3A;&#x7231;&#x597D;&#x8005;&#x548C;&#x521D;&#x5B66;&#x8005;&#xFF0C;&#x8FDC;&#x8FDC;&#x4E0D;&#x5230;&#x80FD;&#x78B0;&#x5230;&#x5F15;&#x64CE;&#x5929;&#x82B1;&#x677F;&#x7684;&#x5730;&#x6B65;&#x3002;</p>
<h4 id="&#x4E2D;&#x7ACB;">&#x4E2D;&#x7ACB;</h4>
<p>&#x800C;&#x5BF9;&#x4E8E;&#x90FD;&#x4E0D;&#x6392;&#x65A5;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x66F4;&#x591A;&#x662F;&#x63A8;&#x8350;<strong>GameMaker</strong>&#x548C;<strong>Unity</strong>&#x3002;</p>
<p>GameMaker&#x5C5E;&#x4E8E;&#x5F00;&#x7BB1;&#x5373;&#x7528;&#xFF0C;&#x975E;&#x5E38;&#x9002;&#x5408;&#x521D;&#x5B66;&#x8005;&#xFF0C;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x914D;&#x7F6E;&#x73AF;&#x5883;&#xFF0C;&#x5176;&#x5185;&#x7F6E;&#x7684;&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x9009;&#x62E9;&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;&#xFF0C;GML&#x8BED;&#x8A00;&#x4E5F;&#x5C5E;&#x4E8E;&#x6700;&#x5BB9;&#x6613;&#x5165;&#x95E8;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x7F16;&#x8BD1;&#x901F;&#x5EA6;&#x4E5F;&#x5C5E;&#x4E8E;&#x5F88;&#x5FEB;&#xFF0C;&#x73A9;&#x8D77;&#x6765;&#x5F88;&#x6D41;&#x7545;&#x3002;</p>
<p>Unity&#x6700;&#x5927;&#x4F18;&#x52BF;&#x662F;&#x53EF;&#x62D3;&#x5C55;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x3001;&#x8FD0;&#x884C;&#x65F6;&#x67E5;&#x770B;&#x5C5E;&#x6027;&#x548C;&#x4E30;&#x5BCC;&#x7684;&#x63D2;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x5728;&#x5236;&#x4F5C;&#x5546;&#x4E1A;&#x6E38;&#x620F;&#x65F6;&#x5019;&#x9009;&#x62E9;&#x5B83;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4E30;&#x5BCC;&#x63D2;&#x4EF6;&#x610F;&#x5473;&#x7740;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x4E0D;&#x7528;&#x81EA;&#x5DF1;&#x5904;&#x7406;&#x6BD4;&#x5982;&#x5404;&#x79CD;&#x624B;&#x67C4;&#x9002;&#x914D;&#xFF0C;&#x591A;&#x8BED;&#x8A00;&#x9002;&#x914D;&#xFF0C;&#x624B;&#x673A;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x903B;&#x8F91;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x53EF;&#x4EE5;&#x8D2D;&#x4E70;&#x4E00;&#x4E2A;Platformer&#x5F15;&#x64CE;&#x7136;&#x540E;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5B9A;&#x5236;&#x5316;&#x5F00;&#x53D1;&#xFF0C;&#x6BD4;&#x81EA;&#x5DF1;&#x6CA1;&#x6709;&#x7ECF;&#x9A8C;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x505A;&#x597D;&#x5F88;&#x591A;&#x3002;</p>
<p><strong>&#x6240;&#x4EE5;&#x4E2A;&#x4EBA;&#x63A8;&#x8350;&#x662F;&#x5982;&#x679C;&#x521A;&#x5B66;&#x5236;&#x4F5C;&#x6E38;&#x620F;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD9;&#x51E0;&#x4E2A;&#x5F15;&#x64CE;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5165;&#x624B;&#xFF1A;GameMaker&#xFF0C;Construct&#xFF0C;pico-8&#x6216;&#x8005;MonoGame</strong></p>
<h2 id="&#x5982;&#x4F55;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x5F15;&#x64CE;">&#x5982;&#x4F55;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x5F15;&#x64CE;</h2>
<p>&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x5F15;&#x64CE;&#x6216;&#x8005;&#x81EA;&#x5DF1;&#x5199;&#x70B9;&#x903B;&#x8F91;&#x6211;&#x4F1A;&#x8003;&#x8651;&#x51E0;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x4F55;&#x663E;&#x793A;&#x4E00;&#x4E2A;&#x7CBE;&#x7075;&#xFF08;&#x56FE;&#x7247;&#xFF09;</li>
<li>&#x5982;&#x4F55;&#x63A7;&#x5236;&#x7CBE;&#x7075;&#x79FB;&#x52A8;</li>
<li>&#x7CBE;&#x7075;&#x5982;&#x4F55;&#x64AD;&#x653E;&#x5E27;&#x52A8;&#x753B;</li>
<li>&#x5982;&#x4F55;&#x78B0;&#x5230;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x7CBE;&#x7075;&#x9500;&#x6BC1;&#x5BF9;&#x65B9;</li>
<li>&#x9500;&#x6BC1;&#x5BF9;&#x65B9;&#x65F6;&#x5019;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x7279;&#x6548;&#x52A8;&#x753B;&#x5E76;&#x4E14;&#x64AD;&#x653E;&#x97F3;&#x6548;</li>
<li>&#x64AD;&#x653E;&#x97F3;&#x4E50;</li>
</ul>
<p>&#x8FD9;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#x4E4B;&#x540E;&#x57FA;&#x672C;&#x5C31;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x505A;&#x4E00;&#x4E2A;&#x5C0F;&#x6E38;&#x620F;&#x4E86;&#x3002;&#x4E4B;&#x540E;&#x7684;&#x5404;&#x4E2A;&#x7CFB;&#x7EDF;&#x5C31;&#x9700;&#x8981;&#x65F6;&#x95F4;&#x6162;&#x6162;&#x5B66;&#x4E60;&#x4E86;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x90FD;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x6240;&#x4EE5;&#x5E26;&#x7740;&#x95EE;&#x9898;&#x53BB;&#x601D;&#x8003;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x518D;&#x53BB;&#x5B66;&#x4E60;&#x4F1A;&#x76EE;&#x6807;&#x6027;&#x6BD4;&#x8F83;&#x5F3A;&#x4E5F;&#x6BD4;&#x8F83;&#x6709;&#x6548;&#x7387;&#x3002;&#x4E00;&#x6765;&#x5C31;&#x5168;&#x90E8;&#x5F15;&#x64CE;&#x529F;&#x80FD;&#x8FC7;&#x4E00;&#x904D;&#x6CA1;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x529F;&#x80FD;&#x4F60;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x9047;&#x5230;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x5230;&#x73B0;&#x5728;&#x4E5F;&#x4E0D;&#x4E86;&#x89E3;Unity&#x7684;NavMesh&#x3002;</p>
<h2 id="&#x4E0D;&#x4F1A;&#x753B;&#x753B;&#x600E;&#x4E48;&#x505A;&#x6E38;&#x620F;">&#x4E0D;&#x4F1A;&#x753B;&#x753B;&#x600E;&#x4E48;&#x505A;&#x6E38;&#x620F;</h2>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x5E38;&#x542C;&#x5230;&#xFF0C;&#x6211;&#x521A;&#x5F00;&#x59CB;&#x65F6;&#x5019;&#x4E5F;&#x6BD4;&#x8F83;&#x56F0;&#x6270;&#x3002;&#x5C31;&#x7B97;&#x4E0D;&#x4F1A;&#x753B;&#x753B;&#x4E5F;&#x4E0D;&#x60F3;&#x5B66;&#x753B;&#x753B;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x7F8E;&#x672F;&#x7D20;&#x6750;&#x3002;&#x5236;&#x4F5C;&#x8DF3;&#x8DF3;&#x5C0F;&#x5B50;&#x4E4B;&#x524D;&#x6211;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;&#x8D2D;&#x4E70;&#x7684;&#x5546;&#x4E1A;&#x7D20;&#x6750;&#x5236;&#x4F5C;&#x8FC7;&#x4E86;7&#x4E2A;&#x6E38;&#x620F;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x8FD8;&#x4E00;&#x70B9;&#x4E0D;&#x4F1A;&#x753B;&#x753B;&#x3002;</p>
<p>&#x6211;&#x7ECF;&#x5E38;&#x8D2D;&#x4E70;&#x7684;&#x7F51;&#x7AD9;&#x6709;<a href="https://itch.io/" target="_blank">itch.io</a>, <a href="https://graphicriver.net/game-assets" target="_blank">graphicriver</a>, <a href="https://www.gamedevmarket.net/" target="_blank">gamedevmarket</a>, <a href="https://assetstore.unity.com/" target="_blank">unity asset store</a>&#x3002;</p>
<p>&#x800C;&#x514D;&#x8D39;&#x7684;&#x53EF;&#x4EE5;&#x770B;&#x4E0B;&#xFF1A;<a href="https://kenney.nl/" target="_blank">kenny</a>&#x548C;<a href="https://opengameart.org/" target="_blank">opengameart</a>&#x3002;</p>
<p>&#x800C;&#x5982;&#x679C;&#x662F;&#x517C;&#x804C;&#x5E73;&#x53F0;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4E0B;&#xFF1A;<a href="https://www.upwork.com/" target="_blank">upwork</a>, <a href="https://www.fiverr.com/" target="_blank">fiverr</a> &#x548C; <a href="https://mihuashi.com/" target="_blank">&#x7C73;&#x753B;&#x5E08;</a></p>
<p>&#x4E5F;&#x8BB8;&#x6709;&#x4EBA;&#x4F1A;&#x89C9;&#x5F97;&#x8FD9;&#x6837;&#x6CA1;&#x827A;&#x672F;&#x6027;&#x4E0D;&#x552F;&#x4E00;&#x800C;&#x4E14;&#x9650;&#x5236;&#x591A;&#x591A;&#xFF0C;&#x6211;&#x66F4;&#x591A;&#x662F;&#x89C9;&#x5F97;&#x6E38;&#x620F;&#x5C31;&#x8FD8;&#x6CA1;&#x505A;&#x51E0;&#x4E2A;&#x5148;&#x4E0D;&#x8981;&#x8C08;&#x827A;&#x672F;&#x6027;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x628A;&#x6E38;&#x620F;&#x505A;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x6700;&#x597D;&#x8FD8;&#x662F;&#x81EA;&#x5DF1;&#x53BB;&#x5B66;&#x4E0B;&#x7ED8;&#x753B;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x6709;&#x6CA1;&#x540C;&#x4F34;&#x5408;&#x4F5C;&#x3002;</p>
<h2 id="&#x63A8;&#x8350;&#x7684;&#x4E66;&#x7C4D;&#x548C;&#x8D44;&#x6E90;">&#x63A8;&#x8350;&#x7684;&#x4E66;&#x7C4D;&#x548C;&#x8D44;&#x6E90;</h2>
<p>&#x53EF;&#x80FD;&#x89C6;&#x9891;&#x6709;&#x4E9B;&#x9700;&#x8981;&#x79D1;&#x5B66;&#x4E0A;&#x7F51;&#xFF0C;&#x5728;B&#x7AD9;&#x641C;&#x7D22;&#x5E94;&#x8BE5;&#x4E5F;&#x53EF;&#x4EE5;&#x3002;</p>
<p><strong>&#x5F15;&#x64CE;&#x76F8;&#x5173;</strong></p>
<p>Unity&#x7684;&#x8BDD;&#x53EA;&#x63A8;&#x8350;&#x4E00;&#x672C;&#x4E66;&#x7C4D;&#xFF1A;<a href="https://book.douban.com/subject/27021785/" target="_blank">&#x6E38;&#x620F;&#x8BBE;&#x8BA1;&#x3001;&#x539F;&#x578B;&#x4E0E;&#x5F00;&#x53D1;</a> </p>
<p>Unity&#x76F8;&#x5173;&#x6559;&#x5B66;&#x89C6;&#x9891;&#xFF1A;<a href="https://www.youtube.com/user/Brackeys" target="_blank">Brackys</a> , <a href="https://www.youtube.com/channel/UC9Z1XWw1kmnvOOFsj6Bzy2g" target="_blank">Blackthornprod</a> , <a href="https://www.youtube.com/channel/UCmtyQOKKmrMVaKuRXz02jbQ" target="_blank">Sebastian Lague</a> , <a href="https://www.youtube.com/channel/UCLyVUwlB_Hahir_VsKkGPIA" target="_blank">Mix and Jam</a></p>
<p>GameMaker&#x89C6;&#x9891;&#xFF1A;<a href="https://www.youtube.com/user/uheartbeast" target="_blank">HeartBeast</a> </p>
<p>Pico-8&#x89C6;&#x9891;: <a href="https://www.youtube.com/channel/UCbMjF_cWciuBUZjILNL1fyA" target="_blank">Nerdy Teachers</a></p>
<p>&#x8FDB;&#x9636;&#x8D44;&#x6599;&#xFF1A;</p>
<p><a href="https://gpp.tkchu.me/" target="_blank">&#x6E38;&#x620F;&#x7F16;&#x7A0B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</a> &#xFF0C; <a href="https://book.douban.com/subject/25815142/" target="_blank">&#x6E38;&#x620F;&#x5F15;&#x64CE;&#x67B6;&#x6784;</a> &#xFF0C;  <a href="https://book.douban.com/subject/3433594/" target="_blank">Data structure for Game Programmers</a></p>
<p><strong>&#x50CF;&#x7D20;&#x7F8E;&#x672F;&#x76F8;&#x5173;</strong></p>
<p><a href="https://pixellogicbook.com/" target="_blank">Pixel Logic</a></p>
<p><a href="https://blog.studiominiboss.com/pixelart" target="_blank">MiniBoss</a></p>
<p><a href="https://www.udemy.com/course/pixel-art-master-course/" target="_blank">Udemy&#x7684;Pixel Art Master Course</a></p>
<p><a href="https://www.youtube.com/channel/UCsn9MzwyPKeCE6MEGtMU4gg" target="_blank">Mort Mort</a></p>
<p><a href="http://pixeljoint.com/" target="_blank">Pixel Joint</a></p>
<p><strong>&#x6E38;&#x620F;&#x8BBE;&#x8BA1;&#x76F8;&#x5173;</strong></p>
<p>&#x4E66;&#x7C4D;&#xFF1A;</p>
<p><a href="https://book.douban.com/subject/25761063/" target="_blank">&#x901A;&#x5173;&#xFF01;&#x6E38;&#x620F;&#x8BBE;&#x8BA1;&#x4E4B;&#x9053;</a></p>
<p><a href="https://book.douban.com/subject/26653173/" target="_blank">&#x6E38;&#x620F;&#x8BBE;&#x8BA1;&#x7684;236&#x4E2A;&#x6280;&#x5DE7;</a></p>
<p><a href="https://book.douban.com/subject/27055726/" target="_blank">&#x5927;&#x5E08;&#x8C08;&#x6E38;&#x620F;&#x8BBE;&#x8BA1;</a></p>
<p><a href="https://book.douban.com/subject/26791007/" target="_blank">&#x6E38;&#x620F;&#x8BBE;&#x8BA1;&#x827A;&#x672F;</a></p>
<p>&#x89C6;&#x9891;&#xFF1A;</p>
<p><a href="https://www.youtube.com/channel/UCqJ-Xo29CKyLTjn6z2XwYAw" target="_blank">Game Maker&#x2019;s Toolkit</a> / <a href="https://space.bilibili.com/180052141" target="_blank">B&#x7AD9;&#x5361;&#x59D0;&#x7FFB;&#x8BD1;</a></p>
<p><a href="https://www.youtube.com/channel/UCCODtTcd5M1JavPCOr_Uydg" target="_blank">Extra Credit</a></p>
<p><a href="https://www.youtube.com/channel/UCNOVwMpD-5A1xzcQGbIHNeA" target="_blank">Design Doc</a></p>
<p><a href="https://www.youtube.com/channel/UCxO_ya-RmAXCXJCU54AxYFw" target="_blank">New Frame Plus</a></p>
<p><a href="https://www.youtube.com/channel/UCEas6ztXcwEkbaClw4zof9g" target="_blank">How Did They Do That</a> </p>
<p><a href="https://www.youtube.com/channel/UC8A3Zig-dNx2kZmy1FovTEA" target="_blank">Video Game Animation Study</a></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5236;&#x4F5C;&#x6E38;&#x620F;&#x5F88;&#x597D;&#x73A9;&#xFF0C;&#x5E0C;&#x671B;&#x4F60;&#x80FD;&#x73A9;&#x5F97;&#x5F00;&#x5FC3;&#xFF01;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="GameProgramTutorial.html" class="navigation navigation-prev " aria-label="Previous page: 游戏编程入门指南">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="EditorTutorial.html" class="navigation navigation-next " aria-label="Next page: Unity拓展编辑器入门指南">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"独立游戏开发入门指南","level":"1.3","depth":1,"next":{"title":"Unity拓展编辑器入门指南","level":"1.4","depth":1,"path":"EditorTutorial.md","ref":"EditorTutorial.md","articles":[]},"previous":{"title":"游戏编程入门指南","level":"1.2","depth":1,"path":"GameProgramTutorial.md","ref":"GameProgramTutorial.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"IndieGameDevTutorial.md","mtime":"2020-02-27T07:22:29.611Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-02-28T03:19:59.469Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

